//Запитуємо ім'я користувача й виводимо значення
let name = prompt('Як тебе звати користувачу?');
alert('Привіт, ' + name + '!');

//Запитуємо рік народження користувача, обраховуємо й виводимо значення
const YEAR = 2024;
let birthdYear = YEAR - prompt('Введіть, будь ласка, рік свого народження:');
alert('Тобі ' + birthdYear);

//Запитуємо довжину сторони квадрату, обраховуємо периметр й виводимо значення
let length = prompt('Введіть довжину сторони квадрату:');
alert('Периметр квадрату становить: ' + (4 * length).toFixed(2));

//Запитуємо радіус кола, обраховуємо площу й виводимо значення
let radius = prompt('Введіть радіус кола: ');
alert('Площа кола становить: ' + (Math.PI * radius * radius).toFixed(2));

//Запитуємо відстань в км між містами; запитуємо час; обраховуємо швидкість з якою потрібно рухатися й виводимо значення
let distance = prompt('Введіть відстань між містами (км):');
let time = prompt('Введіть час, за який ви хочете дістатися (годин):');
alert('Щоб встигнути вчасно, вам потрібно рухатися зі швидкістю ' + (distance / time).toFixed(2) + ' км/год.');

//Користувач вводить долари, обраховуємо й виводимо в євро
const exchangeRate = 0.9;
let dollars = prompt("Введіть суму в доларах для конвертації в євро:");
alert(dollars + " доларів дорівнює " + (dollars * exchangeRate).toFixed(2) + " євро.");