import methodAge from './js/method-age.js';
import methodSpecialSymbol from './js/method-symbol.js';
import methodSumRange from './js/method-range.js';
import greatestCommonDivisor from './js/method-divisor.js';
import methodAllDivisor from './js/method-all-divisor.js';
import methodPalindrome from './js/method-palindrome.js';
import methodDiscount from './js/method-discount.js';
import methodCounterNumbers from './js/method-counter-numbers.js';
import methodWeekDays from './js/method-week-days.js';
import methodGame from './js/method-game.js';
import methodMultiplicationTabel from './js/method-multiplication-table.js';
import methodNextDay from './js/method-next-day.js';
//Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...),
//передбач можливість введення невірних даних.
methodAge();

//Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
methodSpecialSymbol();

//Підрахуй суму всіх чисел в заданому користувачем діапазоні.
methodSumRange();

//Запитай у користувача 2 числа і знайди найбільший спільний дільник.
greatestCommonDivisor();

//Запитай у користувача число і виведи всі дільники цього числа.
methodAllDivisor();

//Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.
methodPalindrome();

//Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
//від 200 до 300 - знижка буде 3%; 
//від 300 до 500 - 5%;
//від 500 і вище - 7%.
methodDiscount();

//Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. 
//При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. 
//Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
methodCounterNumbers();

//Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
methodWeekDays();

//Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: 
//кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». 
//Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. 
//Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N 
//(буде корисним почитати про алгоритм: "бінарний пошук").
methodGame();

//Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
methodMultiplicationTabel();

//Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.
methodNextDay();
