import showArguments from './js/show-arguments.js';
import getValue from './js/get-value.js';
import calcFactorial from './js/calc-factorial.js';
import createValue from './js/create-value.js';
import calcArea from './js/calc-area.js';
import checkValue from './js/check-value.js';
import checkRange from './js/check-range.js';
//Напиши всі можливі варіанти створення функцій.
/*
function showMessage() {
  alert('Всім привіт!');
}

const showMessage = function() {
  alert('Всім привіт!');
};

const showMessage = () => {
  alert('Всім привіт!');
};

const showMessage = (function(){
  alert('Всім привіт!');
})();

const showMessage = (() => {
  alert('Всім привіт!');
})();
*/

//Створи функцію, яка буде виводити кількість переданих їй аргументів.
showArguments(1, 3, 5, 4);

//Напиши функцію, яка приймає 2 числа і повертає :
//-1, якщо перше число менше, ніж друге; 
//1 - якщо перше число більше, ніж друге; 
//0 - якщо числа рівні.
getValue(4, 3);

//Напиши функцію, яка обчислює факторіал переданого їй числа.
calcFactorial(2);

//Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.
createValue(4,5,2);

//Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.
calcArea(2, 4);

//Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.
checkValue(3);

//Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. 
//Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.
checkRange(1,100);







